fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ВыводДополнительныхРеквизитов();	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВыводДополнительныхРеквизитов()

	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_ДатаНачалаДействияДоговора";        
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_ДатаОкончанияДействияДоговора";        
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаЕжемесячнойАбонентскойПлаты", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_СуммаЕжемесячнойАбонентскойПлаты";        
    
    НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"),
	Элементы.Список);
    НовыйЭлемент.ПутьКДанным = "Список.ВКМ_СтоимостьЧасаРаботыСпециалиста";        
	
КонецПроцедуры

#КонецОбласти
